--ตารางผู้บริจากเลือด
create table Donor(
d_id varchar(10),
d_cid varchar(20) not null,
d_name varchar(100) not null,
d_bdate date,
d_age int,
d_gen varchar(20),
d_bg varchar(5),
d_rh varchar(5),
d_count int,
d_addr varchar(255),
d_tel varchar(20),
d_nat varchar(50),
d_lastdt date,

constraint Donor_d_id primary key(d_id),
constraint Donor_d_cid unique(d_cid)
)


--ตารางข้อมูลคัดกรองก่อนบริจาค
create table PreDonationScreen(
ps_id varchar(10),
ps_did varchar(10) not null,
ps_date date not null,
ps_wt float,
ps_bp varchar(20),
ps_pr varchar(20),
ps_temp float,
ps_hb float,
ps_rbc float,
ps_cd text,
ps_med text,
ps_surg text,
ps_ttpr text,
ps_inf text,
ps_preg text,
ps_travel text,
ps_rest text,
ps_result varchar(50),

constraint PreDonationScreen_ps_id primary key(ps_id),
constraint PreDonationScreen_ps_did foreign key(ps_did)
references Donor(d_id)
)


--ตารางประวัติการบริจาคเลือด
create table Donation(
dt_id varchar(10),
dt_did varchar(10),
dt_dt datetime not null,
dt_loc varchar(100),
dt_type varchar(50),
dt_vol int,
dt_symd text,
dt_syma text,
dt_note text,

constraint Donation_dt_id primary key(dt_id),
constraint Donation_dt_did foreign key(dt_did)
references Donor(d_id)
)


--ตารางคลังเลือด
create table BloodBag(
bb_id varchar(10),
bb_dtid varchar(10) not null,
bb_did varchar(10) not null,
bb_bg varchar(5),
bb_date date,
bb_exp date,
bb_status varchar(50),

constraint BloodBag_bb_id primary key(bb_id),
constraint BloodBag_bb_dtid foreign key(bb_dtid)
references Donation(dt_id),
constraint BloodBag_bb_did foreign key(bb_did)
references Donor(d_id)
)


--ตารางผลตรวจคัดกรองเลือด
create table LabTest(
lt_id varchar(10),
lt_dtid varchar(10),
lt_did varchar(10),
lt_date date,
lt_hiv varchar(20),
lt_hbv varchar(20),
lt_hcv varchar(20),
lt_syp varchar(20),
lt_mal varchar(20),
lt_bt varchar(20),
lt_unit varchar(100),
lt_result varchar(50),

constraint LabTest_lt_id primary key(lt_id),
constraint LabTest_lt_dtid foreign key(lt_dtid)
references Donation(dt_id),
constraint LabTest_lt_did foreign key(lt_did)
references Donor(d_id)
)


--เพิ่มข้อมูล

--ข้อมูลตาราง Donor
INSERT INTO Donor (d_id, d_cid, d_name, d_bdate, d_age, d_gen, d_bg, d_rh, d_count, d_addr, d_tel, d_nat, d_lastdt) VALUES
('D001','1245678901234','สมชาย พงษ์ไทย','1990-03-21',35,'ชาย','A','+',5,'12/3 ถ.ประชาอุทิศ เขตดินแดง กรุงเทพฯ','0891234567','ไทย','2025-01-12'),
('D002','1678901234567','กมลพร วัฒนะชัย','1998-11-10',27,'หญิง','O','+',2,'88 ม.5 ต.บางรัก อ.เมือง จ.ตราด','0943452211','ไทย','2024-12-22'),
('D003','1109876543210','วิทวัส อนุรักษ์','1985-05-17',40,'ชาย','B','+',12,'52/14 ม.2 ต.ท่าโพธิ์ อ.เมือง จ.พิษณุโลก','0817653210','ไทย','2025-02-05'),
('D004','1893456789012','ปาริฉัตร ศรีสวัสดิ์','2001-01-30',24,'หญิง','AB','+',1,'145/22 ถ.รัชดา เขตห้วยขวาง กรุงเทพฯ','0629981122','ไทย','2024-11-18'),
('D005','1789012345678','จิรายุ ทองมาก','1993-07-09',32,'ชาย','O','-',7,'9/1 ซ.เจริญนคร เขตคลองสาน กรุงเทพฯ','0951238899','ไทย','2025-01-20'),
('D006','1554321678901','สุภาวดี หาญกล้า','1999-09-12',26,'หญิง','A','+',3,'ม.3 ต.ลำลูกกา อ.ลำลูกกา จ.ปทุมธานี','0821115667','ไทย','2024-12-15'),
('D007','1234987650123','ภาณุวัฒน์ อินทรานนท์','1988-04-05',37,'ชาย','B','+',10,'44/6 ถ.โพธิ์กลาง อ.เมือง จ.นครราชสีมา','0802031122','ไทย','2025-02-01'),
('D008','1345678901245','นนทกานต์ ชัยศรี','1996-02-14',29,'หญิง','O','+',4,'23/9 ต.แม่เหียะ อ.เมือง จ.เชียงใหม่','0933459901','ไทย','2024-10-25'),
('D009','1786543210987','ชญานนท์ สิริสกุล','2000-06-18',25,'ชาย','AB','+',2,'77 ถ.เลี่ยงเมือง อ.เมือง จ.ขอนแก่น','0812229988','ไทย','2024-11-30'),
('D010','1676543211234','ณัฐธิดา สมบัติเดช','1994-12-03',31,'หญิง','A','-',6,'99/3 ม.8 อ.เมือง จ.ระยอง','0867895432','ไทย','2024-12-28'),
('D011','1456789012345','ทศพล เกียรติรุ่ง','1987-11-26',38,'ชาย','O','+',14,'อ.เมือง จ.ชลบุรี','0897771122','ไทย','2025-01-05'),
('D012','1667890123456','มัณฑนา ชูชัย','1995-01-11',30,'หญิง','B','+',5,'อ.แกลง จ.ระยอง','0912334551','ไทย','2025-02-02'),
('D013','1776543210099','วรเมธ ศรีวรกุล','1992-03-27',33,'ชาย','A','+',9,'อ.เมือง จ.นครปฐม','0834412299','ไทย','2024-12-08'),
('D014','1334567890123','กชกร ปิ่นทอง','1997-04-22',28,'หญิง','O','+',3,'อ.เมือง จ.สงขลา','0981234433','ไทย','2025-01-17'),
('D015','1122334455667','อาทิตย์ แสงบัว','1986-09-19',39,'ชาย','AB','+',11,'อ.เมือง จ.พะเยา','0823347783','ไทย','2024-11-26'),
('D016','1999888877776','สุรีรัตน์ คำดี','1999-06-01',26,'หญิง','A','+',2,'อ.สันทราย จ.เชียงใหม่','0941123345','ไทย','2024-08-14'),
('D017','1002003004005','ชัชวาล พรมดี','1984-01-29',41,'ชาย','B','-',16,'อ.เมือง จ.อุดรธานี','0819882211','ไทย','2025-02-07'),
('D018','1567892345671','อรพิน นิลโชติ','1993-10-02',32,'หญิง','O','+',4,'อ.เมือง จ.เชียงราย','0871238890','ไทย','2024-12-10'),
('D019','1445566778899','ณัฐกิตติ์ ใจดี','2002-02-09',23,'ชาย','A','+',1,'อ.เมือง จ.ลำปาง','0899987223','ไทย','2024-09-17'),
('D020','1332456790123','ศศิภา ธรรมสอน','1990-11-15',34,'หญิง','AB','-',8,'อ.เมือง จ.พิษณุโลก','0828892344','ไทย','2025-01-25')

select * from Donor

--ข้อมูลตาราง PreDonationScreen
INSERT INTO PreDonationScreen (
    ps_id, ps_did, ps_date, ps_wt, ps_bp, ps_pr, ps_temp, ps_hb, ps_rbc,
    ps_cd, ps_med, ps_surg, ps_ttpr, ps_inf, ps_preg, ps_travel,
    ps_rest, ps_result
)
VALUES
('PS001', 'D001', '2025-01-12', 72.5, '120/78', 72, 36.6, 15.1, 5.2,
 'ไม่มี', 'ไม่มี', 'ไม่มี', 'ไม่มี', 'ไม่มี', 'ไม่เกี่ยวข้อง', 'ไม่มี', 'เพียงพอ', 'ผ่าน'),

('PS002', 'D002', '2024-12-22', 54.2, '110/70', 80, 36.7, 14.8, 4.9,
 'ไม่มี', 'วิตามินซี', 'ไม่มี', 'ไม่มี', 'ไม่มี', 'ไม่ตั้งครรภ์', 'ไม่มี', 'เพียงพอ', 'ผ่าน'),

('PS003', 'D003', '2025-02-05', 68.0, '125/82', 75, 36.5, 15.5, 5.3,
 'ความดันเล็กน้อย', 'ไม่มี', 'ไส้ติ่ง', 'ไม่มี', 'ไม่มี', 'ไม่เกี่ยวข้อง', 'ไม่มี', 'เพียงพอ', 'ผ่าน'),

('PS004', 'D004', '2024-11-18', 49.5, '108/72', 78, 36.8, 14.2, 4.7,
 'ไม่มี', 'ยาแก้แพ้', 'ไม่มี', 'สัก 1 ปีที่แล้ว', 'ไม่มี', 'ไม่ตั้งครรภ์', 'ไม่มี', 'เพียงพอ', 'ผ่าน'),

('PS005', 'D005', '2025-01-20', 75.3, '130/85', 70, 36.7, 15.0, 4.8,
 'ภูมิแพ้', 'ไม่มี', 'ไม่มี', 'ไม่มี', 'ไม่มี', 'ไม่เกี่ยวข้อง', 'ไม่มี', 'ไม่เพียงพอ', 'ไม่ผ่าน'),

('PS006', 'D006', '2024-12-15', 52.0, '112/74', 82, 36.6, 14.9, 5.0,
 'ไม่มี', 'ไม่มี', 'ไม่มี', 'ไม่มี', 'ไม่มี', 'ไม่ตั้งครรภ์', 'ไม่มี', 'เพียงพอ', 'ผ่าน'),

('PS007', 'D007', '2025-02-01', 70.8, '118/76', 74, 36.5, 15.3, 5.1,
 'ไม่มี', 'วิตามินรวม', 'ไม่มี', 'ไม่มี', 'ไม่มี', 'ไม่เกี่ยวข้อง', 'ไม่มี', 'เพียงพอ', 'ผ่าน'),

('PS008', 'D008', '2024-10-25', 56.4, '115/73', 79, 36.7, 14.6, 4.6,
 'ไมเกรน', 'ยาไมเกรน', 'ไม่มี', 'ไม่มี', 'ไม่มี', 'ไม่ตั้งครรภ์', 'ไม่มี', 'ไม่เพียงพอ', 'ไม่ผ่าน'),

('PS009', 'D009', '2024-11-30', 68.9, '122/80', 77, 36.6, 15.2, 5.2,
 'ไม่มี', 'ไม่มี', 'ไม่มี', 'เจาะหู', 'ไม่มี', 'ไม่เกี่ยวข้อง', 'ไม่มี', 'เพียงพอ', 'ผ่าน'),

('PS010', 'D010', '2024-12-28', 53.3, '110/68', 85, 36.8, 14.4, 4.7,
 'โรคเลือดจางเล็กน้อย', 'ธาตุเหล็ก', 'ไม่มี', 'ไม่มี', 'ไม่มี', 'ไม่ตั้งครรภ์', 'ไม่มี', 'เพียงพอ', 'ผ่าน'),

('PS011', 'D011', '2025-01-05', 73.1, '128/82', 76, 36.5, 15.6, 5.4,
 'ไม่มี', 'ไม่มี', 'ไม่มี', 'ไม่มี', 'ไม่มี', 'ไม่เกี่ยวข้อง', 'ไม่มี', 'เพียงพอ', 'ผ่าน'),

('PS012', 'D012', '2025-02-02', 55.8, '116/74', 81, 36.7, 14.9, 4.9,
 'ไม่มี', 'ยาแก้แพ้', 'ไม่มี', 'ไม่มี', 'ไม่มี', 'ไม่ตั้งครรภ์', 'ไม่มี', 'เพียงพอ', 'ผ่าน'),

('PS013', 'D013', '2024-12-08', 69.4, '124/79', 73, 36.5, 15.4, 5.3,
 'ไม่มี', 'วิตามินบีรวม', 'ไม่มี', 'ไม่มี', 'ไม่มี', 'ไม่เกี่ยวข้อง', 'ไม่มี', 'เพียงพอ', 'ผ่าน'),

('PS014', 'D014', '2025-01-17', 51.2, '110/70', 79, 36.6, 14.7, 4.8,
 'ไม่มี', 'ไม่มี', 'ไม่มี', 'ไม่มี', 'ไม่มี', 'ไม่ตั้งครรภ์', 'ไม่มี', 'เพียงพอ', 'ผ่าน'),

('PS015', 'D015', '2024-11-26', 71.6, '129/84', 74, 36.5, 15.3, 5.1,
 'ภูมิแพ้', 'ยาภูมิแพ้', 'ไม่มี', 'ไม่มี', 'ไม่มี', 'ไม่เกี่ยวข้อง', 'ไม่มี', 'ไม่เพียงพอ', 'ไม่ผ่าน'),

('PS016', 'D016', '2024-08-14', 54.1, '113/72', 80, 36.7, 14.8, 4.9,
 'ไม่มี', 'ไม่มี', 'ไม่มี', 'ไม่มี', 'ไม่มี', 'ไม่ตั้งครรภ์', 'ไม่มี', 'เพียงพอ', 'ผ่าน'),

('PS017', 'D017', '2025-02-07', 76.8, '132/86', 71, 36.6, 15.7, 5.5,
 'ความดัน', 'ยาความดัน', 'ไม่มี', 'ไม่มี', 'ไม่มี', 'ไม่เกี่ยวข้อง', 'ไม่มี', 'ไม่เพียงพอ', 'ไม่ผ่าน'),

('PS018', 'D018', '2024-12-10', 57.5, '114/72', 82, 36.7, 15.0, 5.0,
 'ไมเกรน', 'ไม่มี', 'ไม่มี', 'ไม่มี', 'ไม่มี', 'ไม่ตั้งครรภ์', 'ไม่มี', 'เพียงพอ', 'ผ่าน'),

('PS019', 'D019', '2024-09-17', 63.2, '118/75', 78, 36.5, 15.1, 5.1,
 'ไม่มี', 'ไม่มี', 'ไม่มี', 'เจาะจมูก', 'ไม่มี', 'ไม่เกี่ยวข้อง', 'ไม่มี', 'เพียงพอ', 'ผ่าน'),

('PS020', 'D020', '2025-01-25', 52.9, '111/69', 84, 36.8, 14.5, 4.7,
 'ไม่มี', 'วิตามินรวม', 'ไม่มี', 'ไม่มี', 'ไม่มี', 'ไม่ตั้งครรภ์', 'ไม่มี', 'เพียงพอ', 'ผ่าน')

 select * from PreDonationScreen

 --ข้อมูลตาราง Donation
 INSERT INTO Donation (dt_id, dt_did, dt_dt, dt_loc, dt_type, dt_vol, dt_symd, dt_syma, dt_note) VALUES
('DT001','D001','2025-01-12','โรงพยาบาลกรุงเทพ','Whole Blood',450,'เวียนหัวเล็กน้อย','ปกติ','ไม่มี'),
('DT002','D002','2025-01-15','โรงพยาบาลตราด','Platelets',300,'รู้สึกอ่อนเพลีย','ปวดแขนเล็กน้อย','ดื่มน้ำมาก'),
('DT003','D003','2025-02-05','โรงพยาบาลพิษณุโลก','Whole Blood',450,'เวียนหัว','เวียนหัวเล็กน้อย','พัก 10 นาที'),
('DT004','D004','2025-01-20','โรงพยาบาลรัชดา','Plasma',350,'ไม่มี','ไม่มี',''),
('DT005','D005','2025-02-01','โรงพยาบาลคลองสาน','Whole Blood',450,'รู้สึกหนาว','ปกติ','ใส่เสื้อหนา'),
('DT006','D006','2025-01-10','โรงพยาบาลปทุมธานี','Platelets',300,'เวียนหัวเล็กน้อย','ปวดแขนเล็กน้อย','ดื่มน้ำมาก'),
('DT007','D007','2025-01-18','โรงพยาบาลนครราชสีมา','Whole Blood',450,'ไม่มี','ไม่มี',''),
('DT008','D008','2025-01-22','โรงพยาบาลเชียงใหม่','Plasma',350,'เวียนหัว','เวียนหัวเล็กน้อย','พัก 10 นาที'),
('DT009','D009','2025-01-25','โรงพยาบาลขอนแก่น','Whole Blood',450,'อ่อนเพลีย','ปกติ','ดื่มน้ำมาก'),
('DT010','D010','2025-01-28','โรงพยาบาลระยอง','Platelets',300,'ไม่มี','ไม่มี',''),
('DT011','D011','2025-02-02','โรงพยาบาลชลบุรี','Whole Blood',450,'เวียนหัว','เวียนหัวเล็กน้อย','พัก 5 นาที'),
('DT012','D012','2025-02-04','โรงพยาบาลระยอง','Plasma',350,'ไม่มี','ไม่มี',''),
('DT013','D013','2025-02-06','โรงพยาบาลนครปฐม','Whole Blood',450,'เวียนหัวเล็กน้อย','ปกติ','ดื่มน้ำมาก'),
('DT014','D014','2025-02-08','โรงพยาบาลสงขลา','Platelets',300,'อ่อนเพลีย','ไม่มี','พักผ่อนเพียงพอ'),
('DT015','D015','2025-02-10','โรงพยาบาลพะเยา','Whole Blood',450,'ไม่มี','ไม่มี',''),
('DT016','D016','2025-02-12','โรงพยาบาลเชียงใหม่','Plasma',350,'เวียนหัว','เวียนหัวเล็กน้อย','ดื่มน้ำมาก'),
('DT017','D017','2025-02-14','โรงพยาบาลอุดรธานี','Whole Blood',450,'อ่อนเพลีย','ปวดแขนเล็กน้อย','พัก 10 นาที'),
('DT018','D018','2025-02-16','โรงพยาบาลเชียงราย','Platelets',300,'ไม่มี','ไม่มี',''),
('DT019','D019','2025-02-18','โรงพยาบาลลำปาง','Whole Blood',450,'เวียนหัว','ปกติ','ดื่มน้ำมาก'),
('DT020','D020','2025-02-20','โรงพยาบาลพิษณุโลก','Plasma',350,'ไม่มี','ไม่มี','')

select * from Donation

--ข้อมูลตาราง BloodBag
INSERT INTO BloodBag (
    bb_id, bb_dtid, bb_did, bb_bg, bb_date, bb_exp, bb_status
) VALUES
('BB001', 'DT001', 'D001', 'A+', '2025-01-10', '2025-04-10', 'พร้อมใช้'),
('BB002', 'DT002', 'D002', 'B+', '2025-01-12', '2025-04-12', 'พร้อมใช้'),
('BB003', 'DT003', 'D003', 'O+', '2025-01-15', '2025-04-15', 'แยกส่วน'),
('BB004', 'DT004', 'D004', 'AB+', '2025-01-20', '2025-04-20', 'พร้อมใช้'),
('BB005', 'DT005', 'D005', 'A-', '2025-01-25', '2025-04-25', 'ต้องทิ้ง'),

('BB006', 'DT006', 'D006', 'B-', '2025-02-02', '2025-05-02', 'พร้อมใช้'),
('BB007', 'DT007', 'D007', 'O-', '2025-02-10', '2025-05-10', 'ใช้แล้ว'),
('BB008', 'DT008', 'D008', 'A+', '2025-02-18', '2025-05-18', 'พร้อมใช้'),
('BB009', 'DT009', 'D009', 'B+', '2025-02-22', '2025-05-22', 'พร้อมใช้'),
('BB010', 'DT010', 'D010', 'O+', '2025-02-28', '2025-05-28', 'แยกส่วน'),

('BB011', 'DT011', 'D011', 'AB-', '2025-03-05', '2025-06-05', 'พร้อมใช้'),
('BB012', 'DT012', 'D012', 'A+', '2025-03-12', '2025-06-12', 'พร้อมใช้'),
('BB013', 'DT013', 'D013', 'B+', '2025-03-15', '2025-06-15', 'ใช้แล้ว'),
('BB014', 'DT014', 'D014', 'O+', '2025-03-20', '2025-06-20', 'ต้องทิ้ง'),
('BB015', 'DT015', 'D015', 'A-', '2025-03-27', '2025-06-27', 'พร้อมใช้'),
('BB016', 'DT016', 'D016', 'B-', '2025-04-01', '2025-07-01', 'พร้อมใช้'),
('BB017', 'DT017', 'D017', 'O-', '2025-04-05', '2025-07-05', 'แยกส่วน'),
('BB018', 'DT018', 'D018', 'A+', '2025-04-12', '2025-07-12', 'พร้อมใช้'),
('BB019', 'DT019', 'D019', 'B+', '2025-04-18', '2025-07-18', 'พร้อมใช้'),
('BB020', 'DT020', 'D020', 'O+', '2025-04-25', '2025-07-25', 'พร้อมใช้')

select * from BloodBag

--ข้อมูลตาราง LabTest
INSERT INTO LabTest (
    lt_id, lt_dtid, lt_did, lt_date,
    lt_hiv, lt_hbv, lt_hcv, lt_syp, lt_mal,
    lt_bt, lt_unit, lt_result
) VALUES
('LT001', 'DT001', 'D001', '2025-01-11', 'ลบ', 'ลบ', 'ลบ', 'ลบ', 'ลบ', 'A+', 'สภากาชาดไทย', 'ผ่าน'),
('LT002', 'DT002', 'D002', '2025-01-13', 'ลบ', 'ลบ', 'ลบ', 'ลบ', 'ลบ', 'B+', 'สภากาชาดไทย', 'ผ่าน'),
('LT003', 'DT003', 'D003', '2025-01-16', 'ลบ', 'ลบ', 'ลบ', 'ลบ', 'ลบ', 'O+', 'สภากาชาดไทย', 'ผ่าน'),
('LT004', 'DT004', 'D004', '2025-01-21', 'ลบ', 'ลบ', 'ลบ', 'ลบ', 'ลบ', 'AB+', 'สภากาชาดไทย', 'ผ่าน'),
('LT005', 'DT005', 'D005', '2025-01-26', 'ลบ', 'ลบ', 'ลบ', 'ลบ', 'ลบ', 'A-', 'โรงพยาบาลศิริราช', 'ผ่าน'),

('LT006', 'DT006', 'D006', '2025-02-03', 'ลบ', 'ลบ', 'ลบ', 'ลบ', 'ลบ', 'B-', 'โรงพยาบาลจุฬาลงกรณ์', 'ผ่าน'),
('LT007', 'DT007', 'D007', '2025-02-11', 'ลบ', 'ลบ', 'ลบ', 'ลบ', 'ลบ', 'O-', 'สภากาชาดไทย', 'ผ่าน'),
('LT008', 'DT008', 'D008', '2025-02-19', 'ลบ', 'ลบ', 'ลบ', 'ลบ', 'ลบ', 'A+', 'โรงพยาบาลรามาธิบดี', 'ผ่าน'),
('LT009', 'DT009', 'D009', '2025-02-23', 'ลบ', 'ลบ', 'ลบ', 'ลบ', 'ลบ', 'B+', 'สภากาชาดไทย', 'ผ่าน'),
('LT010', 'DT010', 'D010', '2025-03-01', 'ลบ', 'ลบ', 'ลบ', 'ลบ', 'ลบ', 'O+', 'โรงพยาบาลศิริราช', 'ผ่าน'),

('LT011', 'DT011', 'D011', '2025-03-06', 'ลบ', 'ลบ', 'ลบ', 'ลบ', 'ลบ', 'AB-', 'โรงพยาบาลรามาธิบดี', 'ผ่าน'),
('LT012', 'DT012', 'D012', '2025-03-13', 'ลบ', 'ลบ', 'ลบ', 'ลบ', 'ลบ', 'A+', 'สภากาชาดไทย', 'ผ่าน'),
('LT013', 'DT013', 'D013', '2025-03-16', 'ลบ', 'ลบ', 'ลบ', 'ลบ', 'ลบ', 'B+', 'สภากาชาดไทย', 'ผ่าน'),
('LT014', 'DT014', 'D014', '2025-03-21', 'ลบ', 'ลบ', 'ลบ', 'บวก', 'ลบ', 'O+', 'โรงพยาบาลจุฬาลงกรณ์', 'ไม่ผ่าน'),
('LT015', 'DT015', 'D015', '2025-03-28', 'ลบ', 'ลบ', 'ลบ', 'ลบ', 'ลบ', 'A-', 'โรงพยาบาลศิริราช', 'ผ่าน'),

('LT016', 'DT016', 'D016', '2025-04-02', 'ลบ', 'ลบ', 'ลบ', 'ลบ', 'ลบ', 'B-', 'สภากาชาดไทย', 'ผ่าน'),
('LT017', 'DT017', 'D017', '2025-04-06', 'ลบ', 'ลบ', 'ลบ', 'ลบ', 'ลบ', 'O-', 'โรงพยาบาลจุฬาลงกรณ์', 'ผ่าน'),
('LT018', 'DT018', 'D018', '2025-04-13', 'ลบ', 'ลบ', 'ลบ', 'ลบ', 'ลบ', 'A+', 'สภากาชาดไทย', 'ผ่าน'),
('LT019', 'DT019', 'D019', '2025-04-19', 'ลบ', 'ลบ', 'ลบ', 'ลบ', 'ลบ', 'B+', 'โรงพยาบาลรามาธิบดี', 'ผ่าน'),
('LT020', 'DT020', 'D020', '2025-04-26', 'ลบ', 'ลบ', 'ลบ', 'ลบ', 'ลบ', 'O+', 'สภากาชาดไทย', 'ผ่าน')

select * from LabTest

UPDATE Donor 
SET d_age= '25',
    d_lastdt = '27/11/2568'
WHERE d_id= 'D001'


--ตารางของ Admin
CREATE TABLE Admins(
    A_ID Varchar(50) ,
    A_Password VARCHAR(255) NOT NULL,
    A_Name VARCHAR(100) NOT NULL,
    A_Role VARCHAR(50) NOT NULL DEFAULT 'Admin',                     
    A_CAt DATE

	constraint admins_A_ID primary key(A_ID)
)